fonecmid-diplom/src/Documents/ВКМ_ОбслуживаниеКлиента/ВКМ_ОбслуживаниеКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ОбслуживаниеКлиента</name>
  <registerRecords>AccumulationRegister.BKM_ВыполненныеКлиентуРаботы</registerRecords>
  <registerRecords>AccumulationRegister.BKM_ВыполненныеСотрудникомРаботы</registerRecords>
  <attributes>
    <name>ВКМ_Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_Специалист</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаПроведенияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ВремяНачалаРабот</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>BKM_ВремяОкончанияРабот</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>BKM_ОписаниеПроблемы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>BKM_ВыполненныеРаботы</name>
    <attributes>
      <name>BKM_ОписаниеРабот</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>BKM_ФактическиПотраченоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>BKM_ЧасыКОплатеКлиенту</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/InformationRegisters/BKM_УсловияОплатыСотрудников/BKM_УсловияОплатыСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>BKM_УсловияОплатыСотрудников</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>Оклад</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроцентОтРабот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

fonecmid-diplom/src/AccumulationRegisters/BKM_ВыполненныеКлиентуРаботы/BKM_ВыполненныеКлиентуРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>BKM_ВыполненныеКлиентуРаботы</name>
  <resources>
    <name>BKM_КоличествоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>BKM_СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>BKM_Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>BKM_Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/AccumulationRegisters/BKM_ВыполненныеСотрудникомРаботы/BKM_ВыполненныеСотрудникомРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>BKM_ВыполненныеСотрудникомРаботы</name>
  <resources>
    <name>ЧасовКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ПериодДействияНачало</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаАбонентскойПлаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>BKM_ПериодДействияКонец</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

fonecmid-diplom/src/Documents/ВКМ_ОбслуживаниеКлиента/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Сообщение = "";
	Если ЭтоНовый() Тогда
		Сообщение = СтрШаблон("Создан новый документ ОбслуживаниеКлиента. Назначенный специалист: %1",ВКМ_Специалист);
		НоваяЗапись = Справочники.BKM_УведомлениеТГ.СоздатьЭлемент();
		НоваяЗапись.BKM_ТекстСообщения = Сообщение;
		НоваяЗапись.Записать();
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_ОбслуживаниеКлиента.ВКМ_ДатаПроведенияРабот КАК ВКМ_ДатаПроведенияРабот,
		|	ВКМ_ОбслуживаниеКлиента.ВКМ_Специалист КАК ВКМ_Специалист,
		|	ВКМ_ОбслуживаниеКлиента.BKM_ВремяОкончанияРабот КАК BKM_ВремяОкончанияРабот,
		|	ВКМ_ОбслуживаниеКлиента.ВКМ_ВремяНачалаРабот КАК ВКМ_ВремяНачалаРабот
		|ИЗ
		|	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
		|ГДЕ
		|	ВКМ_ОбслуживаниеКлиента.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда

		Если Выборка.ВКМ_ДатаПроведенияРабот <> ВКМ_ДатаПроведенияРабот Тогда
			Сообщение = СтрШаблон("дата проведения работ. Было: %1, Стало: %2", 
							Выборка.ВКМ_ДатаПроведенияРабот, ВКМ_ДатаПроведенияРабот);
		КонецЕсли;
		
		Если Выборка.ВКМ_Специалист <> ВКМ_Специалист Тогда
			Если ЗначениеЗаполнено(Сообщение) Тогда
				Сообщение = Сообщение + "; ";
			КонецЕсли;
			Сообщение = Сообщение + СтрШаблон("специалист. Было: %1, Стало: %2",
							Выборка.ВКМ_Специалист, ВКМ_Специалист);
		КонецЕсли;
		
		Если Выборка.BKM_ВремяОкончанияРабот <> BKM_ВремяОкончанияРабот Тогда
			Если ЗначениеЗаполнено(Сообщение) Тогда
				Сообщение = Сообщение + "; ";
			КонецЕсли;
			Сообщение = Сообщение + СтрШаблон("время окончания работ. Было: %1, Стало: %2",
							Выборка.BKM_ВремяОкончанияРабот, BKM_ВремяОкончанияРабот);
		КонецЕсли;
		
		Если Выборка.ВКМ_ВремяНачалаРабот <> ВКМ_ВремяНачалаРабот Тогда
			Если ЗначениеЗаполнено(Сообщение) Тогда
				Сообщение = Сообщение + "; ";
			КонецЕсли;
			Сообщение = Сообщение + СтрШаблон("время начала работ. Было: %1, Стало: %2",
							Выборка.ВКМ_ВремяНачалаРабот, ВКМ_ВремяНачалаРабот);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Сообщение) Тогда	
			СообщениеИзм = СтрШаблон("В ""%1"" были изменены: %2", Ссылка, Сообщение);
			СообщениеИзм = СообщениеИзм + ".";
			НоваяЗапись = Справочники.BKM_УведомлениеТГ.СоздатьЭлемент();
			НоваяЗапись.BKM_ТекстСообщения = СообщениеИзм;
			НоваяЗапись.Записать();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры


Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДоговорыКонтрагентов.ВидДоговора КАК ВидДоговора,
		|	ДоговорыКонтрагентов.ВКМ_ПериодДействияНачало КАК ВКМ_ПериодДействияНачало,
		|	ДоговорыКонтрагентов.BKM_ПериодДействияКонец КАК BKM_ПериодДействияКонец,
		|	ДоговорыКонтрагентов.ВКМ_СтоимостьЧасаРаботы КАК ВКМ_СтоимостьЧасаРаботы,
		|	ВКМ_ОбслуживаниеКлиента.ВКМ_Специалист КАК ВКМ_Специалист,
		|	ВКМ_ОбслуживаниеКлиента.BKM_ВыполненныеРаботы.(
		|		BKM_ЧасыКОплатеКлиенту КАК BKM_ЧасыКОплатеКлиенту) КАК BKM_ВыполненныеРаботы,
		|	ЕСТЬNULL(BKM_УсловияОплатыСотрудниковСрезПоследних.ПроцентОтРабот, 0) КАК ПроцентОтРабот,
		|	ВКМ_ОбслуживаниеКлиента.ВКМ_Клиент КАК ВКМ_Клиент,
		|	ВКМ_ОбслуживаниеКлиента.ВКМ_Договор КАК ВКМ_Договор,
		|	ВКМ_ОбслуживаниеКлиента.Дата КАК Дата,
		|	BKM_УсловияОплатыСотрудниковСрезПоследних.Сотрудник КАК Сотрудник
		|ИЗ
		|	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|		ПО ВКМ_ОбслуживаниеКлиента.ВКМ_Договор = ДоговорыКонтрагентов.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.BKM_УсловияОплатыСотрудников.СрезПоследних(&Дата, МЕСЯЦ(Период) = МЕСЯЦ(&Дата)) КАК
		|			BKM_УсловияОплатыСотрудниковСрезПоследних
		|		ПО ВКМ_ОбслуживаниеКлиента.ВКМ_Специалист = BKM_УсловияОплатыСотрудниковСрезПоследних.Сотрудник
		|ГДЕ
		|	ДоговорыКонтрагентов.Ссылка = &СсылкаДоговор
		|	И ВКМ_ОбслуживаниеКлиента.Ссылка = &СсылкаДок";
	
	Запрос.УстановитьПараметр("СсылкаДоговор", ВКМ_Договор);
	Запрос.УстановитьПараметр("СсылкаДок", Ссылка);
	Запрос.УстановитьПараметр("Дата", Дата);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание и
		 ВыборкаДетальныеЗаписи.Дата < ВыборкаДетальныеЗаписи.BKM_ПериодДействияКонец и 
		 ВыборкаДетальныеЗаписи.Дата > ВыборкаДетальныеЗаписи.ВКМ_ПериодДействияНачало Тогда
		 	
			Движения.BKM_ВыполненныеКлиентуРаботы.Записывать = Истина;
			ВыборкаРаботы = ВыборкаДетальныеЗаписи.BKM_ВыполненныеРаботы.Выбрать();
			
			Пока ВыборкаРаботы.Следующий() Цикл
				Движение = Движения.BKM_ВыполненныеКлиентуРаботы.Добавить();
				Движение.Период = ВыборкаДетальныеЗаписи.Дата;
				Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
				Движение.BKM_Клиент = ВыборкаДетальныеЗаписи.ВКМ_Клиент;
				Движение.BKM_Договор = ВыборкаДетальныеЗаписи.ВКМ_Договор;
				Движение.BKM_КоличествоЧасов = ВыборкаРаботы.BKM_ЧасыКОплатеКлиенту;
				Движение.BKM_СуммаКОплате = ВыборкаРаботы.BKM_ЧасыКОплатеКлиенту * ВыборкаДетальныеЗаписи.ВКМ_СтоимостьЧасаРаботы;
			КонецЦикла;
			
		КонецЕсли;
		
		Если не ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Сотрудник) Тогда
			Сообщение = СтрШаблон("Ошибка, специалисту %1 на дату %2 не установлен процент от работ",
								ВыборкаДетальныеЗаписи.ВКМ_Специалист, Формат(Дата,"ДФ=dd.MM.yyyy;"));
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Сообщение);
			Отказ = Истина;
			
		ИначеЕсли ВыборкаДетальныеЗаписи.ПроцентОтРабот > 0 Тогда
			Движения.BKM_ВыполненныеСотрудникомРаботы.Записывать = Истина;
			ВыборкаРаботы = ВыборкаДетальныеЗаписи.BKM_ВыполненныеРаботы.Выбрать();
			
			Пока ВыборкаРаботы.Следующий() Цикл
				Движение = Движения.BKM_ВыполненныеСотрудникомРаботы.Добавить();
				Движение.Период = ВыборкаДетальныеЗаписи.Дата;
				Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
				Движение.Сотрудник = ВыборкаДетальныеЗаписи.ВКМ_Специалист;
				Движение.ЧасовКОплате = ВыборкаРаботы.BKM_ЧасыКОплатеКлиенту;
				Движение.СуммаКОплате = ВыборкаРаботы.BKM_ЧасыКОплатеКлиенту *  ВыборкаДетальныеЗаписи.ВКМ_СтоимостьЧасаРаботы *
									ВыборкаДетальныеЗаписи.ПроцентОтРабот / 100;					 
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
